In [ ]:
import numpy as np
import pandas as pd

In [ ]:
d1 = {'Name': ['Pankaj', 'Meghna', 'David', 'Lisa'], 'ID': [1, 2, 3, 4], 'Salary': [100, 200, np.nan, pd.NaT],
      'Role': ['CEO', None, pd.NaT, pd.NaT]}

In [ ]:
df = pd.DataFrame(d1)

In [ ]:
print(df)

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT

In [ ]:
df.head(2)

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None

In [ ]:
df.tail(2)

    Name  ID Salary Role
2  David   3    NaN  NaT
3   Lisa   4    NaT  NaT

In [ ]:
df.isnull().sum()

Name      0
ID        0
Salary    2
Role      3
dtype: int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   ID      4 non-null      int64
 2   Salary  2 non-null      object
 3   Role    1 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

In [ ]:
df1 = df.dropna()

In [ ]:
print(df1)

     Name  ID Salary Role
0  Pankaj   1    100  CEO

In [ ]:
df1 = df.dropna(axis=1)
print(df1)

     Name  ID
0  Pankaj   1
1  Meghna   2
2   David   3
3    Lisa   4

In [ ]:
df['Salary'].fillna('300',inplace=True)

In [ ]:
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    300   NaT
3    Lisa   4    300   NaT

In [ ]:
df['Role'].fillna('CEO',inplace=True)

In [ ]:
df

     Name  ID Salary Role
0  Pankaj   1    100  CEO
1  Meghna   2    200  CEO
2   David   3    300  CEO
3    Lisa   4    300  CEO